## Assignment Files
        Titanic Train.csv|Test.csv

# Part A: Datawarehouse


        This practical aims to develop data warehouses for data-driven applications. To do this, you
        need to use and apply some of the concepts and techniques introduced in the lectures so far.
        Use PostgreSQL database, Python and its libraries to define and set up a data warehouse for
        one data-driven application.

        The first thing to do is to install PostgreSQL on your computer. The assignment should be
        solved in Python. You can use the following packages for this assignment:
             SQLAlchemy 1.4+ will be used to connect to your database
             You need to install and import all the necessary libraries (e. g. psycopg2 drivers)
             Pandas 1.3+

        The documentation of SQLAlchemy can be found here: https://docs.sqlalchemy.org/en/14.
        There are very interesting tutorials you can go through to help you understand how to
        connect to a DB/DW, how to interact with it, etc. Use those packages as you need them.

# Q1: Data Cube

        Data Loading:

        Load the Titanic dataset into a Pandas DataFrame and inspect the first few rows.
        Import the dataset into a SQL database table 'TitanicRecords' and perform a simple query to retrieve a subset of the data.

In [6]:
pip install psycopg2

Requirement already satisfied: psycopg2 in c:\users\shams\anaconda3\lib\site-packages (2.9.10)
Note: you may need to restart the kernel to use updated packages.

In [10]:
import pandas as pd
import numpy as np
import os

import matplotlib.pyplot as plt
import seaborn as sn

import sqlalchemy as db
engine = db.create_engine('postgresql://postgres:123@localhost:5432/postgres')
#check whether you connected
engine.connect()

In [28]:
titanic_df = pd.read_csv("C:\\Users\\shams\\Downloads\\train (1).csv")
print(titanic_df.head())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

In [30]:
def write_dataset(name,dataset,engine):
    dataset.to_sql('%s' % (name),engine,index=True,if_exists='replace',chunksize=1000)

write_dataset('TitanicRecords', titanic_df, engine)

# Data Exploration:

        Calculate the total number of passengers in the dataset.
        Find the number of missing values for each column in the dataset.

In [84]:
connection = engine.connect()

from sqlalchemy import text
t = text('SELECT COUNT("PassengerId") FROM "TitanicRecords"')
result = connection.execute(t)

# Fetch the result
count = result.scalar()
print(count)

# Close the connection (optional but good practice)
connection.close()

891

In [64]:
def read_dataset(name,engine):
    try:
        dataset = pd.read_sql_table(name,engine)
    except:
        dataset = pd.DataFrame([])
    return dataset

read_dataset('TitanicRecords', engine)

,index,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,None,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,None,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,None,S
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,None,S
887,887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,None,S
889,889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,None,Q

In [86]:
#Find the number of missing values for each column in the dataset.
connection = engine.connect()

# Step 1: Get the column names for the table
table_name = "TitanicRecords"
query = text(f"""
    SELECT column_name
    FROM information_schema.columns
    WHERE table_name = '{table_name}'
""")

columns = connection.execute(query).fetchall()
columns = [col[0] for col in columns]

# Step 2: Construct a query to count NULLs for each column
null_count_query = "SELECT "

# Create a COUNT NULL statement for each column
for col in columns:
    null_count_query += f"SUM(CASE WHEN \"{col}\" IS NULL THEN 1 ELSE 0 END) AS \"{col}_null_count\", "

# Remove the last comma and space, then add the table name
null_count_query = null_count_query.rstrip(", ") + f" FROM \"{table_name}\""

# Step 3: Execute the constructed query
null_count_result = connection.execute(text(null_count_query)).fetchone()

# Step 4: Display the result
null_counts = dict(zip(columns, null_count_result))
for col, count in null_counts.items():
    print(f"{col}: {count} missing values")

# Close the connection (optional but good practice)
connection.close()

index: 0 missing values
PassengerId: 0 missing values
Survived: 0 missing values
Pclass: 0 missing values
Age: 177 missing values
SibSp: 0 missing values
Parch: 0 missing values
Fare: 0 missing values
Cabin: 687 missing values
Name: 0 missing values
Sex: 0 missing values
Ticket: 0 missing values
Embarked: 2 missing values

# Data Cleaning:

        Impute missing values in the "Age" column with the median age.
        Remove rows with missing values in the "Embarked" column.

In [ ]:
connection = engine.connect()

from sqlalchemy import text

# Query to calculate the median age
median_query = text("""
    SELECT PERCENTILE_CONT(0.5) WITHIN GROUP (ORDER BY "Age") 
    FROM "TitanicRecords"
    WHERE "Age" IS NOT NULL
""")
median_age = connection.execute(median_query).scalar()
print(f"Median Age: {median_age}")

#impute the missing values in the Embarked Column
# Query to update the NULL values in the Age column with the median age
update_query = text(f"""
    UPDATE "TitanicRecords"
    SET "Age" = :median_age
    WHERE "Age" IS NULL
""")
connection.execute(update_query, {"median_age": median_age})
print("Missing values in 'Age' column have been updated with the median.")

# Close the connection (optional but good practice)
connection.close()

In [88]:
#Remove rows with missing values in the "Embarked" column.
connection = engine.connect()

from sqlalchemy import text

# Query to delete rows where "Embarked" column is NULL
delete_query = text("""
    DELETE FROM "TitanicRecords"
    WHERE "Embarked" IS NULL
""")
connection.execute(delete_query)

print("Rows with missing 'Embarked' values have been deleted.")

# Close the connection (optional but good practice)
connection.close()

Rows with missing 'Embarked' values have been deleted.

# Feature Engineering:
    
        Calculate the average age of passengers.
        Find the percentage of passengers who survived.

In [90]:
#Calculate the average age of passengers.
connection = engine.connect()

from sqlalchemy import text

# Query to calculate the average age of passengers
avg_age_query = text('SELECT AVG("Age") FROM "TitanicRecords" WHERE "Age" IS NOT NULL')
result = connection.execute(avg_age_query)

# Fetch the result
average_age = result.scalar()
print(f"Average Age of passengers: {average_age}")

# Close the connection (optional but good practice)
connection.close()

Average Age of passengers: 29.69911764705882

In [96]:
#Find the percentage of passengers who survived.
connection = engine.connect()

from sqlalchemy import text

# Step 1: Count the total number of passengers
total_passengers_query = text('SELECT COUNT("PassengerId") FROM "TitanicRecords"')
total_passengers = connection.execute(total_passengers_query).scalar()

# Step 2: Count the number of passengers who survived (assuming "Survived" column is 1 for survivors)
survived_passengers_query = text('SELECT COUNT("PassengerId") FROM "TitanicRecords" WHERE "Survived" = 1')
survived_passengers = connection.execute(survived_passengers_query).scalar()

# Step 3: Calculate the percentage of survivors
percentage_survived = (survived_passengers / total_passengers) * 100
print(f"Percentage of passengers who survived: {percentage_survived:.2f}%")

# Close the connection (optional but good practice)
connection.close()

Percentage of passengers who survived: 38.38%

# Survival Analysis:

        Determine the survival rate of passengers based on their gender.
        Calculate the survival rate for each passenger class.

In [98]:
#Determine the survival rate of passengers based on their gender.

connection = engine.connect()

from sqlalchemy import text

# Step 1: Calculate the total number of male and female passengers
total_gender_query = text("""
    SELECT "Sex", COUNT("PassengerId") AS total_passengers
    FROM "TitanicRecords"
    GROUP BY "Sex"
""")
total_gender_result = connection.execute(total_gender_query).fetchall()

# Step 2: Calculate the number of survivors based on gender
survived_gender_query = text("""
    SELECT "Sex", COUNT("PassengerId") AS survived_passengers
    FROM "TitanicRecords"
    WHERE "Survived" = 1
    GROUP BY "Sex"
""")
survived_gender_result = connection.execute(survived_gender_query).fetchall()

# Step 3: Calculate survival rates for each gender
total_gender_dict = {row["Sex"]: row["total_passengers"] for row in total_gender_result}
survived_gender_dict = {row["Sex"]: row["survived_passengers"] for row in survived_gender_result}

# Calculate the survival rate for each gender
for gender in total_gender_dict:
    total = total_gender_dict[gender]
    survived = survived_gender_dict.get(gender, 0)  # default to 0 if no survivors in a group
    survival_rate = (survived / total) * 100
    print(f"Survival rate for {gender}: {survival_rate:.2f}%")

# Close the connection (optional but good practice)
connection.close()

TypeError: tuple indices must be integers or slices, not str

# Descriptive Analytics:

        Calculate the average age of passengers.
        Find the percentage of passengers who survived.

# Data Filtering:

        Filter the data to show only passengers who were under the age of 18.
        Filter the data to show only first-class passengers.

# Data Visualization:

        Create a bar chart showing the survival rates for different passenger classes.
        Plot a histogram of passenger ages.

# SQL Queries:

        Write SQL queries to find the total number of passengers in each passenger class.
        Use SQL to retrieve the names and ages of passengers who survived.
        Use SQL query to delete Passengers name
        Select only female data and create seprate table with name 'FemaleRecords'
        Select only male data and create seprate table with name 'MaleRecords'
        Delet previous table 'TitanicRecords'.

# Use RegExp to find how many passesnger use Mr. or Mrs. with there names